astb_relise/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <comment>Номенклатура для выдачи</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСинхронизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАнтропометрическогоСвойства</name>
    <type>
      <types>CatalogRef.ВидыАнтропометрическихСвойств</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьВидАнтропометрическогоСвойстваПриАнализе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРост</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСИЗ</name>
    <type>
      <types>CatalogRef.ВидыСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесДляУчетаЧистки</name>
    <comment>Вес для учета чистки (химчистки) СИЗ</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьКакКомплектВЗаказеПоставщикуИОтчетеДляСАП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьШтрихкод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимоеКоличествоЦикловЧистки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРазмеровМеньше</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРазмеровБольше</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозможнаАвтоматизированнаяВыдача</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматизированнаяВыдачаБезОшибок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьПриФормированииЗаказовПоставщику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриниматьНаХранение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСбыта</name>
    <type>
      <types>EnumRef.СтатусыСбыта</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУчетаКомплектаДляППС</name>
    <type>
      <types>EnumRef.ВидыУчетаКомплектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМаркированнойНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыМаркированнойНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаХранения</name>
    <type>
      <types>CatalogRef.ТочкиХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодлежитУтилизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НавигационнаяСсылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рейтинг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокЭксплуатации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяДляПримеркиВTexel</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРоста</name>
    <type>
      <types>CatalogRef.ВидыАнтропометрическихСвойств</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГОСТы</name>
    <attributes>
      <name>ГОСТ</name>
      <type>
        <types>CatalogRef.ГОСТы</types>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сертификаты</name>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

astb_relise/src/Catalogs/Номенклатура/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЭтотОбъект.ЭтоГруппа И ЭтотОбъект.Комплект И ЭтотОбъект.Комплектующие.Количество() = 0 Тогда
		
		КлючДанных = ПроцедурыРаботыСНормамиСервер.КлючДанныхДляСообщенияПользователю(ЭтотОбъект);
		
		ТекстСообщения = НСтр("ru='Не заполнена таблица комплектующих'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,КлючДанных,"Комплектующие","Объект",Отказ);
		
	КонецЕсли;
	
	//проверка пола комплекта (51781)
	Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
		
		Если ЭтотОбъект.Комплект Тогда
			
			Если НЕ ЭтотОбъект.Комплектующие.Количество() = 0 И ЗначениеЗаполнено(ЭтотОбъект.Пол) Тогда
				
				ПолНеСовпадает = Истина;
				
				Для Каждого СтрокаКомплектующих Из ЭтотОбъект.Комплектующие Цикл
					
					Если СтрокаКомплектующих.Номенклатура.Пол = Перечисления.ПолФизическогоЛица.ПустаяСсылка() Тогда
						ПолНеСовпадает = Ложь;
						Прервать;
					КонецЕсли;	
					
					Если НЕ СтрокаКомплектующих.Номенклатура.Пол = ЭтотОбъект.Пол Тогда
						ПолНеСовпадает = Истина;
						Прервать;
					Иначе
						ПолНеСовпадает = Ложь;
					КонецЕсли;
					
				КонецЦикла;	
				
				Если ПолНеСовпадает Тогда
					
					ТекстСообщения = НСтр("ru='Пол комплекта не совпадает с полом комплектующих'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,КлючДанных,"Пол","Объект",Отказ);
					
				КонецЕсли;	
				
			КонецЕсли;
			
		Иначе
			
			Если ЗначениеЗаполнено(ЭтотОбъект.Пол) И ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	НоменклатураКомплектующие.Ссылка КАК Комплект,
				|	НоменклатураКомплектующие.Номенклатура КАК Номенклатура,
				|	НоменклатураКомплектующие.Номенклатура.Пол КАК НоменклатураПол
				|ПОМЕСТИТЬ ВТ_Комплекты
				|ИЗ
				|	Справочник.Номенклатура.Комплектующие КАК НоменклатураКомплектующие
				|ГДЕ
				|	НЕ НоменклатураКомплектующие.Ссылка.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.ПустаяСсылка)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТ_Комплекты.Комплект КАК Комплект,
				|	МИНИМУМ(ВТ_Комплекты.НоменклатураПол) КАК НоменклатураПол
				|ПОМЕСТИТЬ ВТ_ПолКомплектующих
				|ИЗ
				|	ВТ_Комплекты КАК ВТ_Комплекты
				|
				|СГРУППИРОВАТЬ ПО
				|	ВТ_Комплекты.Комплект
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ВТ_ПолКомплектующих.Комплект КАК Комплект
				|ПОМЕСТИТЬ ВТ_КомплектыСПолом
				|ИЗ
				|	ВТ_ПолКомплектующих КАК ВТ_ПолКомплектующих
				|ГДЕ
				|	НЕ ВТ_ПолКомплектующих.НоменклатураПол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.ПустаяСсылка)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ВТ_Комплекты.Комплект КАК Комплект
				|ИЗ
				|	ВТ_Комплекты КАК ВТ_Комплекты
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КомплектыСПолом КАК ВТ_КомплектыСПолом
				|		ПО (ВТ_Комплекты.Комплект = ВТ_КомплектыСПолом.Комплект)
				|ГДЕ
				|	ВТ_Комплекты.Номенклатура = &Номенклатура
				|	И НЕ ВТ_Комплекты.Комплект.Пол = &Пол
				|	И НЕ ВТ_КомплектыСПолом.Комплект ЕСТЬ NULL";
				
				Запрос.УстановитьПараметр("Номенклатура",	ЭтотОбъект.Ссылка);
				Запрос.УстановитьПараметр("Пол",			ЭтотОбъект.Пол);
				
				ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
				
				ТекстСообщения = "";
				
				Для Каждого СтрокаТаблицыЗапроса Из ТаблицаЗапроса Цикл
					
					ТекстСообщения = ТекстСообщения + "Пол комплектующего не совпадает с полом комплекта: (" + СтрокаТаблицыЗапроса.Комплект.Код + ") " + СтрокаТаблицыЗапроса.Комплект.Наименование + Символы.ПС;
					
				КонецЦикла;	
				
				Если НЕ ТекстСообщения = "" Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,КлючДанных,"Пол","Объект",Отказ);
				КонецЕсли;	
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	// Вызывается непосредственно до записи объекта в базу данных.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Наименование = &Наименование
	|	И Номенклатура.КодСинхронизации = &КодСинхронизации
	|	И НЕ Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Наименование", 		Наименование);
	Запрос.УстановитьПараметр("КодСинхронизации", 	КодСинхронизации);
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Номенклатура с такими наименованием и кодом синхронизации уже существует.";
		СообщениеПользователю.Сообщить();
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры

#КонецЕсли
